@channel **Hi Everyone,**

**2023-09-19 `04.1-Data-Analysis-Pandas-Introduction to Pandas & Jupyter`**

Welcome to `Jupyter` realm, this week we'll start working with `Pandas` and how we can use it's magical tools.

We know it's a lot of information and it feels like we're moving quickly through it, so be prepared and invest the time in your education and keep up with your study.

Ask your fellow students if you're comfortable! We're all in this together and everyone is invested in your success.

If you feel comfortable with the material and have the opportunity to help out a fellow classmate, go for it! Teaching someone else will help solidify the concepts you've learned. 

Keep up the effort to learn and focus on the tasks at hand!

Excited to see you in class.

**Objectives**

* Serve Jupyter notebook files from local directories and connect to their development environment
* Create Pandas `DataFrames` from scratch
* Run `functions` on Pandas `DataFrames`
* `read`/`write` DataFrames `from`/`to` CSV files using Pandas

**Slideshows**
* [04.1-Data-Analysis-Pandas-Introduction to Pandas & Jupyter](https://git.bootcampcontent.com/University-of-California---Berkeley/UCB-VIRT-DATA-PT-08-2023-U-LOLC/-/blob/main/Slides/Data-04.1_Introduction_to_Pandas_Jupyter.pdf)

**`04-Pandas` Resources**
* [Pandas Cheatsheet](https://www.dataquest.io/blog/pandas-cheat-sheet/)
* [Pandas Tutorials](https://chrisalbon.com/)
* [Pandas Documentation](http://pandas.pydata.org/)
* [Pandas Guide to Merging](https://pandas.pydata.org/pandas-docs/stable/merging.html)
* [Visual Guide to Joins](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/)
* [Using iloc, loc, & ix to select rows and columns in Pandas DataFrames](https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/)
* [Indexing and selecting data](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)
* [loc and iloc tutorial](https://www.analyticsvidhya.com/blog/2020/02/loc-iloc-pandas/)
* [Deleting from a dataframe](https://pythonexamples.org/pandas-dataframe-delete-column/)
* [GREAT - short article on grouping and sorting](https://medium.com/datamadeeasy/pandas-made-easy-groupby-65e4e3c26a6)
* [Merging Tutorial](https://www.tutorialspoint.com/python_pandas/python_pandas_merging_joining.htm)
* [Binning](https://www.codespeedy.com/binning-or-bucketing-of-column-in-pandas-using-python/)
* [pandas.DataFrame.merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html)
* [pandas.DataFrame.join](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)
* [pandas.cut](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html)

**Install**

```bash
python -m ipykernel install --user --name PythonData
conda install -c anaconda nb_conda_kernels -y
```

**Best wishes.**

# ==========================================

### 1.01 Instructor Do: Introduction to Jupyter Notebook (10 min)

In [1]:
# Running the basic "Hello World" code
hello = "Hello World"
print(hello)

Hello World

In [2]:
# Doing simple math
4 + 4

8

In [3]:
# Storing results in variables
a = 5

In [4]:
# Using those variables elsewhere in the code
a

5

In [5]:
# Variables will hold the value most recently run
# This means that, if we run the code above, it will now print 2
a = 2

In [6]:
a

2

# ==========================================

### 1.02 Students Do: Comic Book Remix (15 min)

# Comic Book Remix

For this activity, you will be creating a Jupyter notebook that performs the same functions as the Comic Book activity from last week.

## Instructions

* Using `comicbooks.py` as a starting point, convert the application so that it runs properly within a Jupyter Notebook.

* Have the application print out the user's input, the path to `comic_books.csv`, and the publisher/date published for the book in different cells.

## Bonus

* Go through any of the activities from last week, and attempt to convert them to run within a Jupyter Notebook. As you go, try to split up the code into cells and print out the outputs.

## References

Data modified from "Comic books CSV" Updated April 2021. Initially released in 2014 to accompany the British Library's exhibition Comics Unmasked. [https://www.bl.uk/collection-metadata/downloads](https://www.bl.uk/collection-metadata/downloads)

---

In [1]:
# Modules
import os
import csv

In [2]:
# Prompt user for video lookup
book = input("What title are you looking for? ")

What title are you looking for?  asd

In [3]:
# Set path for file
csvpath = os.path.join("02-Stu_Comics_Remix_Jupyter", "Solved", "Resources", "comic_books.csv")
print(csvpath)

# Set variable to check if we found the video
found = False

02-Stu_Comics_Remix_Jupyter\Solved\Resources\comic_books.csv

In [4]:
# Open the CSV
with open(csvpath, encoding="utf8") as csvfile:
    csvreader = csv.reader(csvfile, delimiter=",")

    # Loop through looking for the video
    for row in csvreader:
        if row[0] == book:
            print(row[0] + " was published by " + row[8] + " in " + row[9])

            # Set variable to confirm we have found the video
            found = True

    # If the video is never found, alert the user
    if found == False:
        print("We don't seem to have what you are looking for!")

We don't seem to have what you are looking for!

# ==========================================

### 1.03 Instructor Do: Introduction to Pandas / DataFrame Creation (0:05)
### 1.03 Instructor Do: Creating Pandas DataFrames (5 min)

In [31]:
# Dependencies
import pandas as pd

In [36]:
# !pip install pandas

pd.DataFrame(
    {
        "Schools": ["UCLA", "UC Berkeley", "UC Irvine", "University of Central Florida", "Rutgers University"],
        "Schools2": ["UCLA2", "UC Berkeley2", "UC Irvine2", "University of Central Florida2", "Rutgers University2"]
    }
)

                         Schools                        Schools2
0                           UCLA                           UCLA2
1                    UC Berkeley                    UC Berkeley2
2                      UC Irvine                      UC Irvine2
3  University of Central Florida  University of Central Florida2
4             Rutgers University             Rutgers University2

In [37]:
# We can create a Pandas Series from a raw list
data_series = pd.Series(["UCLA", "UC Berkeley", "UC Irvine",
                         "University of Central Florida", "Rutgers University"])
data_series

0                             UCLA
1                      UC Berkeley
2                        UC Irvine
3    University of Central Florida
4               Rutgers University
dtype: object

In [6]:
# Convert a list of dictionaries into a dataframe
states_dicts = [
    {
        "STATE": "New Jersey",
        "ABBREVIATION": "NJ"
    },
    {
        "STATE": "New York",
        "ABBREVIATION": "NY"
    }
]

states_df = pd.DataFrame(states_dicts)
states_df

        STATE ABBREVIATION
0  New Jersey           NJ
1    New York           NY

In [38]:
# Convert a single dictionary containing lists into a dataframe
pharaoh_df = pd.DataFrame(
    {
        "Dynasty": ["Early Dynastic Period", "Old Kingdom"],
        "Pharaoh": ["Thinis", "Memphis"]
    }
)
pharaoh_df

                 Dynasty  Pharaoh
0  Early Dynastic Period   Thinis
1            Old Kingdom  Memphis

# ==========================================

### 1.04 Students Do: DataFrame Shop (15 min)

# DataFrame Shop

In this activity, you will create DataFrames from scratch using both a list of dictionaries and a dictionary of lists.

## Instructions

* Create a DataFrame for a frame shop. The DataFrame should contain three columns,  "Frame", "Price", and "Sales", and have five rows of data stored within it.

* Using an alternative method, create a DataFrame for an art gallery. The DataFrame should contain three columns, "Painting", "Price", and "Popularity", and have four rows of data stored within it.

## Bonus

Once both DataFrames have been created, discuss which method you preferred and why.

---

In [9]:
# Import Dependencies
import pandas as pd

In [10]:
# Create a DataFrame of frames using a dictionary of lists
frame_df = pd.DataFrame({
    "Frame": ["Ornate", "Classical", "Modern", "Wood", "Cardboard"],
    "Price": [15.00, 12.50, 10.00, 5.00, 1.00],
    "Sales": [100, 200, 150, 300, "N/A"]
})
frame_df

       Frame  Price Sales
0     Ornate   15.0   100
1  Classical   12.5   200
2     Modern   10.0   150
3       Wood    5.0   300
4  Cardboard    1.0   N/A

In [39]:
# Create a DataFrame of paintings using a list of dictionaries
painting_df = pd.DataFrame([
    {"Painting": "Mona Lisa (Knockoff)", "Price": 25, "Popularity": "Very Popular"},
    {"Painting": "Van Gogh (Knockoff)", "Price": 20, "Popularity": "Popular"},
    {"Painting": "Starving Artist", "Price": 10, "Popularity": "Average"},
    {"Painting": "Toddler Drawing", "Price": 1, "Popularity": "Not Popular"}
])
painting_df

               Painting  Price    Popularity
0  Mona Lisa (Knockoff)     25  Very Popular
1   Van Gogh (Knockoff)     20       Popular
2       Starving Artist     10       Average
3       Toddler Drawing      1   Not Popular

# ==========================================

### 1.05 Instructor Do: DataFrame Functions (5 min)

In [40]:
# Dependencies
import pandas as pd

In [41]:
# Save path to data set in a variable
data_file = "05-Ins_DataFunctions/Solved/Resources/dataSet.csv"
# data_file = Path(data_file)

In [43]:
# pd.read_csv(data_file)

In [1]:
# Dependencies
import pandas as pd
from pathlib import Path

In [2]:
# Save path to the data set as a variable.
data_file = Path("Resources/car_purchases.csv")

In [3]:
# Use Pandas to the read data.
data_file_df = pd.read_csv(data_file)
data_file_df.head()

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [4]:
# Display a statistical overview of the DataFrame.
data_file_df.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000   9988.738100
std     288.819436   5783.375372
min       1.000000     15.300000
25%     250.750000   5043.150000
50%     500.500000   9899.500000
75%     750.250000  15044.225000
max    1000.000000  19927.900000

In [5]:
# Reference a single column within a DataFrame.
data_file_df["Amount"].head()

0    15484.5
1    13443.3
2     9095.6
3    11871.6
4    13459.8
Name: Amount, dtype: float64

In [6]:
# Reference multiple columns within a DataFrame.
data_file_df[["Amount", "Gender"]].head()

    Amount  Gender
0  15484.5    male
1  13443.3  female
2   9095.6    male
3  11871.6  female
4  13459.8    male

In [7]:
# The mean method averages the series
average = data_file_df["Amount"].mean()
average

9988.738099999993

In [8]:
# The sum method adds every entry in the series
total = data_file_df["Amount"].sum()
total

9988738.100000001

In [9]:
# The unique method shows every element only once
unique = data_file_df["Car"].unique()
unique

array(['Jeep', 'Saturn', 'Ram', 'Dodge', 'Chrysler', 'Cadillac',
       'Pontiac', 'Nissan', 'Lexus', 'Volkswagen', 'Suzuki', 'Kia',
       'Mercury', 'Audi', 'Bugatti', 'BMW', 'Mazda', 'GMC', 'Ford',
       'Mercedes-Benz', 'Land Rover', 'Chevrolet', 'Toyota', 'Honda',
       'Subaru', 'Oldsmobile', 'MINI', 'Lincoln', 'Mitsubishi', 'Isuzu',
       'Infiniti', 'Eagle', 'Saab', 'Buick', 'Volvo', 'Lotus', 'Maserati',
       'Jensen', 'Hyundai', 'Maybach', 'Corbin', 'Acura', 'Ferrari',
       'Plymouth', 'Studebaker', 'Jaguar', 'Rolls-Royce', 'Aston Martin',
       'Merkur', 'CitroÃ«n', 'Daewoo', 'Tesla', 'Porsche', 'Scion', 'Geo',
       'Hummer', 'Lamborghini', 'Fiat', 'Bentley', 'Peugeot', 'Austin',
       'Spyker'], dtype=object)

In [10]:
# The value_counts method counts unique values in a column
count = data_file_df["Gender"].value_counts()
count

male          455
female        446
non-binary     99
Name: Gender, dtype: int64

In [11]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_df["Amount"]/1000
data_file_df["Thousands of Dollars"] = thousands_of_dollars

data_file_df.head()

   id           Full Name  Gender   Amount       Car  Thousands of Dollars
0   1        Minnnie Rean    male  15484.5      Jeep               15.4845
1   2     Ursa Torricella  female  13443.3    Saturn               13.4433
2   3     Joyann Pirolini    male   9095.6       Ram                9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge               11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler               13.4598

# ==========================================

### 1.06 Students Do: Training Grounds (10 min)

# Training Grounds

In this activity, you will take a large DataFrame containing 200 rows, analyze it with data functions, and then add a new column into it.

## Instructions

Using the DataFrame provided, perform all of the following actions:

* Provide a simple analytical overview of the dataset's numeric columns.

* Collect all of the names of the trainers within the dataset.

* Figure out how many students each trainer has.

* Find the average weight of the students at the gym.

* Find the combined weight of all of the students at the gym.

* Convert the "Membership (Days)" column into weeks, and then add this new Series into the DataFrame.

---

In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# A DataFrame of individuals' names, their trainers, their weight, and their days as gym members
training_df = pd.DataFrame({
    "Name":["Gino Walker","Hiedi Wasser","Kerrie Wetzel","Elizabeth Sackett","Jack Mitten","Madalene Wayman","Jamee Horvath","Arlena Reddin","Tula Levan","Teisha Dreier","Leslie Carrier","Arlette Hartson","Romana Merkle","Heath Viviani","Andres Zimmer","Allyson Osman","Yadira Caggiano","Jeanmarie Friedrichs","Leann Ussery","Bee Mom","Pandora Charland","Karena Wooten","Elizabet Albanese","Augusta Borjas","Erma Yadon","Belia Lenser","Karmen Sancho","Edison Mannion","Sonja Hornsby","Morgan Frei","Florencio Murphy","Christoper Hertel","Thalia Stepney","Tarah Argento","Nicol Canfield","Pok Moretti","Barbera Stallings","Muoi Kelso","Cicely Ritz","Sid Demelo","Eura Langan","Vanita An","Frieda Fuhr","Ernest Fitzhenry","Ashlyn Tash","Melodi Mclendon","Rochell Leblanc","Jacqui Reasons","Freeda Mccroy","Vanna Runk","Florinda Milot","Cierra Lecompte","Nancey Kysar","Latasha Dalton","Charlyn Rinaldi","Erline Averett","Mariko Hillary","Rosalyn Trigg","Sherwood Brauer","Hortencia Olesen","Delana Kohut","Geoffrey Mcdade","Iona Delancey","Donnie Read","Cesar Bhatia","Evia Slate","Kaye Hugo","Denise Vento","Lang Kittle","Sherry Whittenberg","Jodi Bracero","Tamera Linneman","Katheryn Koelling","Tonia Shorty","Misha Baxley","Lisbeth Goering","Merle Ladwig","Tammie Omar","Jesusa Avilla","Alda Zabala","Junita Dogan","Jessia Anglin","Peggie Scranton","Dania Clodfelter","Janis Mccarthy","Edmund Galusha","Tonisha Posey","Arvilla Medley","Briana Barbour","Delfina Kiger","Nia Lenig","Ricarda Bulow","Odell Carson","Nydia Clonts","Andree Resendez","Daniela Puma","Sherill Paavola","Gilbert Bloomquist","Shanon Mach","Justin Bangert","Arden Hokanson","Evelyne Bridge","Hee Simek","Ward Deangelis","Jodie Childs","Janis Boehme","Beaulah Glowacki","Denver Stoneham","Tarra Vinton","Deborah Hummell","Ulysses Neil","Kathryn Marques","Rosanna Dake","Gavin Wheat","Tameka Stoke","Janella Clear","Kaye Ciriaco","Suk Bloxham","Gracia Whaley","Philomena Hemingway","Claudette Vaillancourt","Olevia Piche","Trey Chiles","Idalia Scardina","Jenine Tremble","Herbert Krider","Alycia Schrock","Miss Weibel","Pearlene Neidert","Kina Callender","Charlotte Skelley","Theodora Harrigan","Sydney Shreffler","Annamae Trinidad","Tobi Mumme","Rosia Elliot","Debbra Putt","Rena Delosantos","Genna Grennan","Nieves Huf","Berry Lugo","Ayana Verdugo","Joaquin Mazzei","Doris Harmon","Patience Poss","Magaret Zabel","Marylynn Hinojos","Earlene Marcantel","Yuki Evensen","Rema Gay","Delana Haak","Patricia Fetters","Vinnie Elrod","Octavia Bellew","Burma Revard","Lakenya Kato","Vinita Buchner","Sierra Margulies","Shae Funderburg","Jenae Groleau","Louetta Howie","Astrid Duffer","Caron Altizer","Kymberly Amavisca","Mohammad Diedrich","Thora Wrinkle","Bethel Wiemann","Patria Millet","Eldridge Burbach","Alyson Eddie","Zula Hanna","Devin Goodwin","Felipa Kirkwood","Kurtis Kempf","Kasey Lenart","Deena Blankenship","Kandra Wargo","Sherrie Cieslak","Ron Atha","Reggie Barreiro","Daria Saulter","Tandra Eastman","Donnell Lucious","Talisha Rosner","Emiko Bergh","Terresa Launius","Margy Hoobler","Marylou Stelling","Lavonne Justice","Kala Langstaff","China Truett","Louanne Dussault","Thomasena Samaniego","Charlesetta Tarbell","Fatimah Lade","Malisa Cantero","Florencia Litten","Francina Fraise","Patsy London","Deloris Mclaughlin"],
    "Trainer":['Bettyann Savory','Mariah Barberio','Gordon Perrine','Pa Dargan','Blanch Victoria','Aldo Byler','Aldo Byler','Williams Camire','Junie Ritenour','Gordon Perrine','Bettyann Savory','Mariah Barberio','Aldo Byler','Barton Stecklein','Bettyann Savory','Barton Stecklein','Gordon Perrine','Pa Dargan','Aldo Byler','Brittani Brin','Bettyann Savory','Phyliss Houk','Bettyann Savory','Junie Ritenour','Aldo Byler','Calvin North','Brittani Brin','Junie Ritenour','Blanch Victoria','Brittani Brin','Bettyann Savory','Blanch Victoria','Mariah Barberio','Bettyann Savory','Blanch Victoria','Brittani Brin','Junie Ritenour','Pa Dargan','Gordon Perrine','Phyliss Houk','Pa Dargan','Mariah Barberio','Phyliss Houk','Phyliss Houk','Calvin North','Williams Camire','Brittani Brin','Gordon Perrine','Bettyann Savory','Bettyann Savory','Pa Dargan','Phyliss Houk','Barton Stecklein','Blanch Victoria','Coleman Dunmire','Phyliss Houk','Blanch Victoria','Pa Dargan','Harland Coolidge','Calvin North','Bettyann Savory','Phyliss Houk','Bettyann Savory','Harland Coolidge','Gordon Perrine','Junie Ritenour','Harland Coolidge','Blanch Victoria','Mariah Barberio','Coleman Dunmire','Aldo Byler','Bettyann Savory','Gordon Perrine','Bettyann Savory','Barton Stecklein','Harland Coolidge','Aldo Byler','Aldo Byler','Pa Dargan','Junie Ritenour','Brittani Brin','Junie Ritenour','Gordon Perrine','Mariah Barberio','Mariah Barberio','Mariah Barberio','Bettyann Savory','Brittani Brin','Aldo Byler','Phyliss Houk','Blanch Victoria','Pa Dargan','Phyliss Houk','Brittani Brin','Barton Stecklein','Coleman Dunmire','Bettyann Savory','Bettyann Savory','Gordon Perrine','Blanch Victoria','Junie Ritenour','Phyliss Houk','Coleman Dunmire','Williams Camire','Harland Coolidge','Williams Camire','Aldo Byler','Harland Coolidge','Gordon Perrine','Brittani Brin','Coleman Dunmire','Calvin North','Phyliss Houk','Brittani Brin','Aldo Byler','Bettyann Savory','Brittani Brin','Gordon Perrine','Calvin North','Harland Coolidge','Coleman Dunmire','Harland Coolidge','Aldo Byler','Junie Ritenour','Blanch Victoria','Harland Coolidge','Blanch Victoria','Junie Ritenour','Harland Coolidge','Junie Ritenour','Gordon Perrine','Brittani Brin','Coleman Dunmire','Williams Camire','Junie Ritenour','Brittani Brin','Calvin North','Barton Stecklein','Barton Stecklein','Mariah Barberio','Coleman Dunmire','Bettyann Savory','Mariah Barberio','Pa Dargan','Barton Stecklein','Coleman Dunmire','Brittani Brin','Barton Stecklein','Pa Dargan','Barton Stecklein','Junie Ritenour','Bettyann Savory','Williams Camire','Pa Dargan','Calvin North','Williams Camire','Coleman Dunmire','Aldo Byler','Barton Stecklein','Coleman Dunmire','Blanch Victoria','Mariah Barberio','Mariah Barberio','Harland Coolidge','Barton Stecklein','Phyliss Houk','Pa Dargan','Bettyann Savory','Barton Stecklein','Harland Coolidge','Junie Ritenour','Pa Dargan','Mariah Barberio','Blanch Victoria','Williams Camire','Phyliss Houk','Phyliss Houk','Coleman Dunmire','Mariah Barberio','Gordon Perrine','Coleman Dunmire','Brittani Brin','Pa Dargan','Coleman Dunmire','Brittani Brin','Blanch Victoria','Coleman Dunmire','Gordon Perrine','Coleman Dunmire','Aldo Byler','Aldo Byler','Mariah Barberio','Williams Camire','Phyliss Houk','Aldo Byler','Williams Camire','Aldo Byler','Williams Camire','Coleman Dunmire','Phyliss Houk'],
    "Weight":[128,180,193,177,237,166,224,208,177,241,114,161,162,151,220,142,193,193,124,130,132,141,190,239,213,131,172,127,184,157,215,122,181,240,218,205,239,217,234,158,180,131,194,171,177,110,117,114,217,123,248,189,198,127,182,121,224,111,151,170,188,150,137,231,222,186,139,175,178,246,150,154,129,216,144,198,228,183,173,129,157,199,186,232,172,157,246,239,214,161,132,208,187,224,164,177,175,224,219,235,112,241,243,179,208,196,131,207,182,233,191,162,173,197,190,182,231,196,196,143,250,174,138,135,164,204,235,192,114,179,215,127,185,213,250,213,153,217,176,190,119,167,118,208,113,206,200,236,159,218,168,159,156,183,121,203,215,209,179,219,174,220,129,188,217,250,166,157,112,236,182,144,189,243,238,147,165,115,160,134,245,174,238,157,150,184,174,134,134,248,199,165,117,119,162,112,170,224,247,217],
    "Membership (Days)":[52,70,148,124,186,157,127,155,37,185,158,129,93,69,124,13,76,153,164,161,48,121,167,69,39,163,7,34,176,169,108,162,195,86,155,77,197,200,80,142,179,67,58,145,188,147,125,15,13,173,125,4,61,29,132,110,62,137,197,135,162,174,32,151,149,65,18,42,63,62,104,200,189,40,38,199,1,12,8,2,195,30,7,72,130,144,2,34,200,143,43,196,22,115,171,54,143,59,14,52,109,115,187,185,26,19,178,18,120,169,45,52,130,69,168,178,96,22,78,152,39,51,118,130,60,156,108,69,103,158,165,142,86,91,117,77,57,169,86,188,97,111,22,83,81,177,163,35,12,164,21,181,171,138,22,107,58,51,38,128,19,193,157,13,104,89,13,10,26,190,179,101,7,159,100,49,120,109,56,199,51,108,47,171,69,162,74,119,148,88,32,159,65,146,140,171,88,18,59,13]
})
training_df.head()

                Name          Trainer  Weight  Membership (Days)
0        Gino Walker  Bettyann Savory     128                 52
1       Hiedi Wasser  Mariah Barberio     180                 70
2      Kerrie Wetzel   Gordon Perrine     193                148
3  Elizabeth Sackett        Pa Dargan     177                124
4        Jack Mitten  Blanch Victoria     237                186

In [3]:
# Collect a summary of all numeric data
training_df.describe()

           Weight  Membership (Days)
count  200.000000         200.000000
mean   180.820000         101.910000
std     39.372689          60.162025
min    110.000000           1.000000
25%    151.000000          51.000000
50%    180.500000         105.500000
75%    215.000000         157.250000
max    250.000000         200.000000

In [4]:
# Find the names of the trainers
training_df["Trainer"].unique()

array(['Bettyann Savory', 'Mariah Barberio', 'Gordon Perrine',
       'Pa Dargan', 'Blanch Victoria', 'Aldo Byler', 'Williams Camire',
       'Junie Ritenour', 'Barton Stecklein', 'Brittani Brin',
       'Phyliss Houk', 'Calvin North', 'Coleman Dunmire',
       'Harland Coolidge'], dtype=object)

In [5]:
# Find how many students each trainer has
training_df["Trainer"].value_counts()

Bettyann Savory     20
Aldo Byler          17
Coleman Dunmire     17
Brittani Brin       16
Phyliss Houk        16
Mariah Barberio     15
Gordon Perrine      14
Pa Dargan           14
Blanch Victoria     14
Junie Ritenour      14
Barton Stecklein    13
Harland Coolidge    12
Williams Camire     11
Calvin North         7
Name: Trainer, dtype: int64

In [6]:
# Find the average weight of all students
training_df["Weight"].mean()

180.82

In [7]:
# Find the combined weight of all students
training_df["Weight"].sum()

36164

In [8]:
# Convert the membership days into weeks and then adding a column to the DataFrame
weeks = training_df["Membership (Days)"]/7
training_df["Membership (Weeks)"] = weeks

training_df.head()

,Name,Trainer,Weight,Membership (Days),Membership (Weeks)
0,Gino Walker,Bettyann Savory,128,52,7.428571
1,Hiedi Wasser,Mariah Barberio,180,70,10.000000
2,Kerrie Wetzel,Gordon Perrine,193,148,21.142857
3,Elizabeth Sackett,Pa Dargan,177,124,17.714286
4,Jack Mitten,Blanch Victoria,237,186,26.571429

# ==========================================

### BREAK (0:10)

# ==========================================

### 1.07 Instructor Do: Modifying Columns (5 min)

In [86]:
# Import Dependencies
import pandas as pd

In [96]:
# A gigantic DataFrame of individuals' names, their trainers, their weight, and their days as gym members
training_df = pd.DataFrame({
    "Name":["Gino Walker","Hiedi Wasser","Kerrie Wetzel","Elizabeth Sackett","Jack Mitten","Madalene Wayman","Jamee Horvath","Arlena Reddin","Tula Levan","Teisha Dreier","Leslie Carrier","Arlette Hartson","Romana Merkle","Heath Viviani","Andres Zimmer","Allyson Osman","Yadira Caggiano","Jeanmarie Friedrichs","Leann Ussery","Bee Mom","Pandora Charland","Karena Wooten","Elizabet Albanese","Augusta Borjas","Erma Yadon","Belia Lenser","Karmen Sancho","Edison Mannion","Sonja Hornsby","Morgan Frei","Florencio Murphy","Christoper Hertel","Thalia Stepney","Tarah Argento","Nicol Canfield","Pok Moretti","Barbera Stallings","Muoi Kelso","Cicely Ritz","Sid Demelo","Eura Langan","Vanita An","Frieda Fuhr","Ernest Fitzhenry","Ashlyn Tash","Melodi Mclendon","Rochell Leblanc","Jacqui Reasons","Freeda Mccroy","Vanna Runk","Florinda Milot","Cierra Lecompte","Nancey Kysar","Latasha Dalton","Charlyn Rinaldi","Erline Averett","Mariko Hillary","Rosalyn Trigg","Sherwood Brauer","Hortencia Olesen","Delana Kohut","Geoffrey Mcdade","Iona Delancey","Donnie Read","Cesar Bhatia","Evia Slate","Kaye Hugo","Denise Vento","Lang Kittle","Sherry Whittenberg","Jodi Bracero","Tamera Linneman","Katheryn Koelling","Tonia Shorty","Misha Baxley","Lisbeth Goering","Merle Ladwig","Tammie Omar","Jesusa Avilla","Alda Zabala","Junita Dogan","Jessia Anglin","Peggie Scranton","Dania Clodfelter","Janis Mccarthy","Edmund Galusha","Tonisha Posey","Arvilla Medley","Briana Barbour","Delfina Kiger","Nia Lenig","Ricarda Bulow","Odell Carson","Nydia Clonts","Andree Resendez","Daniela Puma","Sherill Paavola","Gilbert Bloomquist","Shanon Mach","Justin Bangert","Arden Hokanson","Evelyne Bridge","Hee Simek","Ward Deangelis","Jodie Childs","Janis Boehme","Beaulah Glowacki","Denver Stoneham","Tarra Vinton","Deborah Hummell","Ulysses Neil","Kathryn Marques","Rosanna Dake","Gavin Wheat","Tameka Stoke","Janella Clear","Kaye Ciriaco","Suk Bloxham","Gracia Whaley","Philomena Hemingway","Claudette Vaillancourt","Olevia Piche","Trey Chiles","Idalia Scardina","Jenine Tremble","Herbert Krider","Alycia Schrock","Miss Weibel","Pearlene Neidert","Kina Callender","Charlotte Skelley","Theodora Harrigan","Sydney Shreffler","Annamae Trinidad","Tobi Mumme","Rosia Elliot","Debbra Putt","Rena Delosantos","Genna Grennan","Nieves Huf","Berry Lugo","Ayana Verdugo","Joaquin Mazzei","Doris Harmon","Patience Poss","Magaret Zabel","Marylynn Hinojos","Earlene Marcantel","Yuki Evensen","Rema Gay","Delana Haak","Patricia Fetters","Vinnie Elrod","Octavia Bellew","Burma Revard","Lakenya Kato","Vinita Buchner","Sierra Margulies","Shae Funderburg","Jenae Groleau","Louetta Howie","Astrid Duffer","Caron Altizer","Kymberly Amavisca","Mohammad Diedrich","Thora Wrinkle","Bethel Wiemann","Patria Millet","Eldridge Burbach","Alyson Eddie","Zula Hanna","Devin Goodwin","Felipa Kirkwood","Kurtis Kempf","Kasey Lenart","Deena Blankenship","Kandra Wargo","Sherrie Cieslak","Ron Atha","Reggie Barreiro","Daria Saulter","Tandra Eastman","Donnell Lucious","Talisha Rosner","Emiko Bergh","Terresa Launius","Margy Hoobler","Marylou Stelling","Lavonne Justice","Kala Langstaff","China Truett","Louanne Dussault","Thomasena Samaniego","Charlesetta Tarbell","Fatimah Lade","Malisa Cantero","Florencia Litten","Francina Fraise","Patsy London","Deloris Mclaughlin"],
    "Trainer":['Bettyann Savory','Mariah Barberio','Gordon Perrine','Pa Dargan','Blanch Victoria','Aldo Byler','Aldo Byler','Williams Camire','Junie Ritenour','Gordon Perrine','Bettyann Savory','Mariah Barberio','Aldo Byler','Barton Stecklein','Bettyann Savory','Barton Stecklein','Gordon Perrine','Pa Dargan','Aldo Byler','Brittani Brin','Bettyann Savory','Phyliss Houk','Bettyann Savory','Junie Ritenour','Aldo Byler','Calvin North','Brittani Brin','Junie Ritenour','Blanch Victoria','Brittani Brin','Bettyann Savory','Blanch Victoria','Mariah Barberio','Bettyann Savory','Blanch Victoria','Brittani Brin','Junie Ritenour','Pa Dargan','Gordon Perrine','Phyliss Houk','Pa Dargan','Mariah Barberio','Phyliss Houk','Phyliss Houk','Calvin North','Williams Camire','Brittani Brin','Gordon Perrine','Bettyann Savory','Bettyann Savory','Pa Dargan','Phyliss Houk','Barton Stecklein','Blanch Victoria','Coleman Dunmire','Phyliss Houk','Blanch Victoria','Pa Dargan','Harland Coolidge','Calvin North','Bettyann Savory','Phyliss Houk','Bettyann Savory','Harland Coolidge','Gordon Perrine','Junie Ritenour','Harland Coolidge','Blanch Victoria','Mariah Barberio','Coleman Dunmire','Aldo Byler','Bettyann Savory','Gordon Perrine','Bettyann Savory','Barton Stecklein','Harland Coolidge','Aldo Byler','Aldo Byler','Pa Dargan','Junie Ritenour','Brittani Brin','Junie Ritenour','Gordon Perrine','Mariah Barberio','Mariah Barberio','Mariah Barberio','Bettyann Savory','Brittani Brin','Aldo Byler','Phyliss Houk','Blanch Victoria','Pa Dargan','Phyliss Houk','Brittani Brin','Barton Stecklein','Coleman Dunmire','Bettyann Savory','Bettyann Savory','Gordon Perrine','Blanch Victoria','Junie Ritenour','Phyliss Houk','Coleman Dunmire','Williams Camire','Harland Coolidge','Williams Camire','Aldo Byler','Harland Coolidge','Gordon Perrine','Brittani Brin','Coleman Dunmire','Calvin North','Phyliss Houk','Brittani Brin','Aldo Byler','Bettyann Savory','Brittani Brin','Gordon Perrine','Calvin North','Harland Coolidge','Coleman Dunmire','Harland Coolidge','Aldo Byler','Junie Ritenour','Blanch Victoria','Harland Coolidge','Blanch Victoria','Junie Ritenour','Harland Coolidge','Junie Ritenour','Gordon Perrine','Brittani Brin','Coleman Dunmire','Williams Camire','Junie Ritenour','Brittani Brin','Calvin North','Barton Stecklein','Barton Stecklein','Mariah Barberio','Coleman Dunmire','Bettyann Savory','Mariah Barberio','Pa Dargan','Barton Stecklein','Coleman Dunmire','Brittani Brin','Barton Stecklein','Pa Dargan','Barton Stecklein','Junie Ritenour','Bettyann Savory','Williams Camire','Pa Dargan','Calvin North','Williams Camire','Coleman Dunmire','Aldo Byler','Barton Stecklein','Coleman Dunmire','Blanch Victoria','Mariah Barberio','Mariah Barberio','Harland Coolidge','Barton Stecklein','Phyliss Houk','Pa Dargan','Bettyann Savory','Barton Stecklein','Harland Coolidge','Junie Ritenour','Pa Dargan','Mariah Barberio','Blanch Victoria','Williams Camire','Phyliss Houk','Phyliss Houk','Coleman Dunmire','Mariah Barberio','Gordon Perrine','Coleman Dunmire','Brittani Brin','Pa Dargan','Coleman Dunmire','Brittani Brin','Blanch Victoria','Coleman Dunmire','Gordon Perrine','Coleman Dunmire','Aldo Byler','Aldo Byler','Mariah Barberio','Williams Camire','Phyliss Houk','Aldo Byler','Williams Camire','Aldo Byler','Williams Camire','Coleman Dunmire','Phyliss Houk'],
    "Weight":[128,180,193,177,237,166,224,208,177,241,114,161,162,151,220,142,193,193,124,130,132,141,190,239,213,131,172,127,184,157,215,122,181,240,218,205,239,217,234,158,180,131,194,171,177,110,117,114,217,123,248,189,198,127,182,121,224,111,151,170,188,150,137,231,222,186,139,175,178,246,150,154,129,216,144,198,228,183,173,129,157,199,186,232,172,157,246,239,214,161,132,208,187,224,164,177,175,224,219,235,112,241,243,179,208,196,131,207,182,233,191,162,173,197,190,182,231,196,196,143,250,174,138,135,164,204,235,192,114,179,215,127,185,213,250,213,153,217,176,190,119,167,118,208,113,206,200,236,159,218,168,159,156,183,121,203,215,209,179,219,174,220,129,188,217,250,166,157,112,236,182,144,189,243,238,147,165,115,160,134,245,174,238,157,150,184,174,134,134,248,199,165,117,119,162,112,170,224,247,217],
    "Membership(Days)":[52,70,148,124,186,157,127,155,37,185,158,129,93,69,124,13,76,153,164,161,48,121,167,69,39,163,7,34,176,169,108,162,195,86,155,77,197,200,80,142,179,67,58,145,188,147,125,15,13,173,125,4,61,29,132,110,62,137,197,135,162,174,32,151,149,65,18,42,63,62,104,200,189,40,38,199,1,12,8,2,195,30,7,72,130,144,2,34,200,143,43,196,22,115,171,54,143,59,14,52,109,115,187,185,26,19,178,18,120,169,45,52,130,69,168,178,96,22,78,152,39,51,118,130,60,156,108,69,103,158,165,142,86,91,117,77,57,169,86,188,97,111,22,83,81,177,163,35,12,164,21,181,171,138,22,107,58,51,38,128,19,193,157,13,104,89,13,10,26,190,179,101,7,159,100,49,120,109,56,199,51,108,47,171,69,162,74,119,148,88,32,159,65,146,140,171,88,18,59,13]
})
training_df.head(10)

                Name          Trainer  Weight  Membership(Days)
0        Gino Walker  Bettyann Savory     128                52
1       Hiedi Wasser  Mariah Barberio     180                70
2      Kerrie Wetzel   Gordon Perrine     193               148
3  Elizabeth Sackett        Pa Dargan     177               124
4        Jack Mitten  Blanch Victoria     237               186
5    Madalene Wayman       Aldo Byler     166               157
6      Jamee Horvath       Aldo Byler     224               127
7      Arlena Reddin  Williams Camire     208               155
8         Tula Levan   Junie Ritenour     177                37
9      Teisha Dreier   Gordon Perrine     241               185

In [92]:
# ['Name', 'Trainer', 'Weight', 'Membership(Days)']
training_df.columns = ['Name', 'Trainer', 'Weight', 'Membership']

In [93]:
training_df

                   Name          Trainer  Weight  Membership
0           Gino Walker  Bettyann Savory     128          52
1          Hiedi Wasser  Mariah Barberio     180          70
2         Kerrie Wetzel   Gordon Perrine     193         148
3     Elizabeth Sackett        Pa Dargan     177         124
4           Jack Mitten  Blanch Victoria     237         186
..                  ...              ...     ...         ...
195      Malisa Cantero  Williams Camire     112         171
196    Florencia Litten       Aldo Byler     170          88
197     Francina Fraise  Williams Camire     224          18
198        Patsy London  Coleman Dunmire     247          59
199  Deloris Mclaughlin     Phyliss Houk     217          13

[200 rows x 4 columns]

In [81]:
training_df = training_df[['Name', 'Weight', 'Membership(Days)', 'Trainer']]

In [82]:
training_df

                   Name  Weight  Membership(Days)          Trainer
0           Gino Walker     128                52  Bettyann Savory
1          Hiedi Wasser     180                70  Mariah Barberio
2         Kerrie Wetzel     193               148   Gordon Perrine
3     Elizabeth Sackett     177               124        Pa Dargan
4           Jack Mitten     237               186  Blanch Victoria
..                  ...     ...               ...              ...
195      Malisa Cantero     112               171  Williams Camire
196    Florencia Litten     170                88       Aldo Byler
197     Francina Fraise     224                18  Williams Camire
198        Patsy London     247                59  Coleman Dunmire
199  Deloris Mclaughlin     217                13     Phyliss Houk

[200 rows x 4 columns]

In [84]:
training_df.rename(columns={
    "Membership(Days)": "Membership",
})

                   Name  Weight  Membership          Trainer
0           Gino Walker     128          52  Bettyann Savory
1          Hiedi Wasser     180          70  Mariah Barberio
2         Kerrie Wetzel     193         148   Gordon Perrine
3     Elizabeth Sackett     177         124        Pa Dargan
4           Jack Mitten     237         186  Blanch Victoria
..                  ...     ...         ...              ...
195      Malisa Cantero     112         171  Williams Camire
196    Florencia Litten     170          88       Aldo Byler
197     Francina Fraise     224          18  Williams Camire
198        Patsy London     247          59  Coleman Dunmire
199  Deloris Mclaughlin     217          13     Phyliss Houk

[200 rows x 4 columns]

In [97]:
# Collecting a list of all columns within the DataFrame
training_df.columns

Index(['Name', 'Trainer', 'Weight', 'Membership(Days)'], dtype='object')

In [98]:
# Reorganizing the columns using double brackets
organized_df = training_df[["Name","Trainer","Weight","Membership(Days)"]]
organized_df.head()

                Name          Trainer  Weight  Membership(Days)
0        Gino Walker  Bettyann Savory     128                52
1       Hiedi Wasser  Mariah Barberio     180                70
2      Kerrie Wetzel   Gordon Perrine     193               148
3  Elizabeth Sackett        Pa Dargan     177               124
4        Jack Mitten  Blanch Victoria     237               186

In [100]:
# Using .rename(columns={}) in order to rename columns
renamed_df = organized_df.rename(columns={
    "Membership(Days)":"Membership_in_Days",
    "Weight":"Weight_in_Pounds"
})
renamed_df.head()

                Name          Trainer  Weight_in_Pounds  Membership_in_Days
0        Gino Walker  Bettyann Savory               128                  52
1       Hiedi Wasser  Mariah Barberio               180                  70
2      Kerrie Wetzel   Gordon Perrine               193                 148
3  Elizabeth Sackett        Pa Dargan               177                 124
4        Jack Mitten  Blanch Victoria               237                 186

# ==========================================

### 1.08 Students Do: Hey Arnold! (10 min)

# Hey, Arnold!

* This assignment will give you experience creating DataFrames from scratch.

* You will create a pandas DataFrame of characters from this TV show: <https://en.wikipedia.org/wiki/Hey_Arnold!>

## Instructions

* First, use Pandas to create a DataFrame with the following columns and values:

  * `Character_in_show`: Arnold, Gerald, Helga, Phoebe, Harold, Eugene

  * `color_of_hair`: blonde, black, blonde, black, unknown, red

  * `Height`: average, tallish, tallish, short, tall, short

  * `Football_Shaped_Head`: True, False, False, False, False, False

* You'll note that the above column names are inconsistent and difficult to work with. Rename them to the following, respectively:

  * `Character`, `Hair Color`, `Height`, `Football Head`

* Next, create a new table that contains all of the columns in the following order...

  * `Character`, `Football Head`, `Hair Color`, `Height`

In [ ]:
# Dependencies
import pandas as pd

In [ ]:
# Create a DataFrame with given columns and value
hey_arnold_df = pd.DataFrame(
    {"Character_in_show": ["Arnold", "Gerald", "Helga", "Phoebe", "Harold", "Eugene"],
     "color_of_hair": ["blonde", "black", "blonde", "black", "unknown", "red"],
     "Height": ["average", "tallish", "tallish", "short", "tall", "short"],
     "Football_Shaped_Head": [True, False, False, False, False, False]
     })

hey_arnold_df

In [ ]:
# Organize the columns so they are in a more logical order
hey_arnold_alphabetical_df = hey_arnold_df[
    [
        "Character_in_show",
        "Football_Shaped_Head",
        "color_of_hair",
        "Height"
    ]
]

hey_arnold_alphabetical_df

In [ ]:
# Rename columns for readability
hey_arnold_renamed_df = hey_arnold_df.rename(
    columns=
    {
        "Character_in_show": "Character",
        "color_of_hair": "Hair Color",
        "Height": "Height",
        "Football_Shaped_Head": "Football Head"
    }
)
hey_arnold_renamed_df

In [ ]:
# Organize the columns so they are in a more logical order
hey_arnold_alphabetical_df = hey_arnold_renamed_df[
    [
        "Character",
        "Hair Color",
        "Height",
        "Football Head",
        
    ]
]

hey_arnold_alphabetical_df

# ==========================================

### 1.09 Instructor Do: Reading and Writing CSV Files (0:05)

In [1]:
# Dependencies
import pandas as pd
from pathlib import Path

In [2]:
# Store filepath in a variable
file_one = Path("09-Ins_ReadingWritingCSV/Solved/Resources/DataOne.csv")

In [3]:
# Read our data file with the Pandas library
# Not every CSV requires an encoding, but be aware this can come up
file_one_df = pd.read_csv(file_one, encoding="ISO-8859-1")

In [4]:
# Show the first five rows.
file_one_df.head()

   id             full_name                       email      gender
0   1  Jacquenette Nesterov  jnesterov0@squarespace.com      female
1   2       Leanora Cashell       lcashell1@blogger.com        male
2   3         Arley Medford     amedford2@newyorker.com        male
3   4     Rafaello Crawshaw     rcrawshaw3@multiply.com        male
4   5     Karalee Hallaways      khallaways4@uol.com.br  non-binary

In [5]:
# Show a single column
file_one_df["full_name"].head()

0    Jacquenette Nesterov
1         Leanora Cashell
2           Arley Medford
3       Rafaello Crawshaw
4       Karalee Hallaways
Name: full_name, dtype: object

In [6]:
# Show mulitple specific columns--note the extra brackets
file_one_df[["full_name", "email"]].head()

              full_name                       email
0  Jacquenette Nesterov  jnesterov0@squarespace.com
1       Leanora Cashell       lcashell1@blogger.com
2         Arley Medford     amedford2@newyorker.com
3     Rafaello Crawshaw     rcrawshaw3@multiply.com
4     Karalee Hallaways      khallaways4@uol.com.br

In [7]:
# Show the last five rows.
file_one_df.tail()

     id          full_name                      email  gender
95   96    Lucienne McFaul           lmcfaul2n@vk.com  female
96   97  Sheelagh Chretien      schretien2o@google.it    male
97   98       Ransom Smyth     rsmyth2p@geocities.com    male
98   99     Mauricio Goane            mgoane2q@nhs.uk    male
99  100      Iain Stephens  istephens2r@newyorker.com    male

In [8]:
# Export file as a CSV, without the Pandas index, but with the header
file_one_df.to_csv("09-Ins_ReadingWritingCSV/Solved/Output/fileOne.csv", index=False, header=True)

# ==========================================

### 1.10 Students Do: Comic Books Part 1 (15 min)

## Instructions

* Read in the GoodReads CSV using Pandas

* Remove unnecessary columns from the DataFrame so that only the following columns remain: `isbn`, `original_publication_year`, `original_title`, `authors`, `ratings_1`, `ratings_2`, `ratings_3`, `ratings_4`, and `ratings_5`

* Rename the columns to the following: `ISBN`, `Publication Year`, `Original Title`, `Authors`, `One Star Reviews`, `Two Star Reviews`, `Three Star Reviews`, `Four Star Reviews`, and `Five Star Reviews`

* Write the DataFrame into a new CSV file

## Hints

* The base CSV file uses UTF-8 encoding. Trying to read in the file using some other kind of encoding could lead to strange characters appearing within the dataset.

In [ ]:
# Import Dependencies
import pandas as pd

In [ ]:
# Make a reference to the books.csv file path
csv_path = "10-Stu_GoodReadsCSV/Unsolved/Resources/books.csv"

# Import the books.csv file as a DataFrame
books_df = pd.read_csv(csv_path, encoding="utf-8")
books_df.head()

In [ ]:
# Remove unecessary columns from the DataFrame and save the new DataFrame
# Only keep: "isbn", "original_publication_year", "original_title", "authors",
# "ratings_1", "ratings_2", "ratings_3", "ratings_4", "ratings_5"
reduced_df = books_df[["isbn", "original_publication_year", "original_title", "authors",
                       "ratings_1", "ratings_2", "ratings_3", "ratings_4", "ratings_5"]]
reduced_df.head()

In [ ]:
renamed_df = reduced_df
renamed_df.columns = ['ISBN', 'Original Title', 'Publication Year', 'Authors',
       'One Star Reviews', 'Two Star Reviews', 'Three Star Reviews',
                      'Four Star Reviews', 'Five Star Reviews']
renamed_df.head()

In [ ]:
# Rename the headers to be more explanatory
renamed_df = reduced_df.rename(columns={
    "isbn": "ISBN",
    "original_title": "Original Title",
    "original_publication_year": "Publication Year",
    "authors": "Authors",
    "ratings_1": "One Star Reviews",
    "ratings_2": "Two Star Reviews",
    "ratings_3": "Three Star Reviews",
    "ratings_4": "Four Star Reviews",
    "ratings_5": "Five Star Reviews"
})
renamed_df.head()

In [ ]:
names = list(renamed_df.columns)
names
changes = {}
for x in names:
    changes[x] = x.title().replace(" ", "_")
renamed_df = renamed_df.rename(columns=changes)
renamed_df.head()

In [ ]:
# Push the remade DataFrame to a new CSV file
renamed_df.to_csv("10-Stu_GoodReadsCSV/Unsolved/Output/books_clean.csv",
                  encoding="utf-8", index=False, header=True)

# ==========================================

### 1.11 Students Do: GoodReads - Part II (0:15)

## Instructions

* Using the modified DataFrame that was created earlier, create a summary table for the dataset that includes the following pieces of information...

* The count of unique authors within the DataFrame

* The count of unique countries of publication within the DataFrame

* The year of the earliest published book in the DataFrame

* The year of the latest published book in the DataFrame

## Hint

* Research the pandas `sum()` method.

In [ ]:
# Import Dependencies
import pandas as pd

In [ ]:
# File to Load
goodreads_path = "11-Stu_GoodReadsSummary/Unsolved/Resources/books_clean.csv"

# Read the modified GoodReads csv and store into Pandas DataFrame
goodreads_df = pd.read_csv(goodreads_path, encoding="utf-8")
goodreads_df.head()

In [ ]:
columns = list(goodreads_df.columns)
new_names = {}
for x in columns:
    new_names[x] = x.title().replace(" ", "_")
new_names
goodreads_df = goodreads_df.rename(columns=new_names)
goodreads_df.head()

In [ ]:
# Calculate the number of unique authors in the DataFrame
author_count = len(goodreads_df["Authors"].unique())

# Calculate the earliest/latest year a book was published
earliest_year = goodreads_df["Publication_Year"].min()
latest_year = goodreads_df["Publication_Year"].max()

# Calculate the total reviews for the entire dataset
# Hint: use the pandas' sum() method to get the sum for each row
goodreads_df['Total_Reviews'] = goodreads_df.iloc[:, 4:].sum(axis=1)
total_reviews = sum(goodreads_df['Total_Reviews'])
goodreads_df.head()

In [ ]:
# Place all of the data found into a summary DataFrame
summary_df = pd.DataFrame({"Total Unique Authors": [author_count],
                              "Earliest Year": earliest_year,
                              "Latest Year": latest_year,
                              "Total Reviews": total_reviews})
summary_df

# ==========================================

### Rating Class Objectives

* rate your understanding using 1-5 method in each objective

In [ ]:
title = "04-Pandas - Day 1 - Introduction to Pandas & Jupyter"
objectives = [
    "Serve Jupyter notebook files from local directories and connect to their development environment",
    "Create Pandas DataFrames from scratch",
    "Run functions on Pandas DataFrames",
    "Read/Write DataFrames from/to CSV files using Pandas",
]
rating = []
total = 0
for i in range(len(objectives)):
    rate = input(objectives[i]+"? ")
    total += int(rate)
    rating.append(objectives[i] + ". (" + rate + "/5)")
print("="*96)
print(f"Self Evaluation for: {title}")
print("-"*24)
for i in rating:
    print(i)
print("-"*64)
print("Average: " + str(total/len(objectives)))